# -*- coding: utf-8 -*-
# __author__ = "shaycormac"
# Email: 2814913226@qq.com
# Date: 2018/11/21
menu = {
    '北京': {
        '海淀': {
            '五道口': {
                'soho': {},
                '网易': {},
                'google': {}
            },
            '中关村': {
                '爱奇艺': {},
                '汽车之家': {},
                'youku': {},
            },
            '上地': {
                '百度': {},
            },
        },
        '昌平': {
            '沙河': {
                '老男孩': {},
                '北航': {},
            },
            '天通苑': {},
            '回龙观': {},
        },
        '朝阳': {},
        '东城': {},
    },
    '上海': {
        '闵行': {
            "人民广场": {
                '炸鸡店': {}
            }
        },
        '闸北': {
            '火车站': {
                '携程': {}
            }
        },
        '浦东': {},
    },
    '山东': {},
}
while True:
    for key in menu:
        print(key)
    choice = input('>:').strip()
    if not choice:
        continue
# 需求：
# 可依次选择进入各子菜单
# 可从任意一层往回退到上一层
# 可从任意一层退出程序
# 所需新知识点：列表、字典
# 踩分点:
#
# 1. 实现功能70分；
# 2. 只用一个while循环，且整体代码量多于15行需求全部完成给85分(数据源dict不算代码量)；
# 3. 只用一个while循环，且整体代码量少于15行90分。
